Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_i2c.c
  tmpVal = BL_RD_REG(I2Cx, I2C_INT_STS);
  return ((BL_IS_REG_BIT_SET(tmpVal, I2C_END_INT)) ? SET : RESET);
}

/****************************************************************************/ /**
                                                                                * @brief  I2C master write block data
                                                                                *
                                                                                * @param  i2cNo: I2C ID type
                                                                                * @param  cfg: I2C transfer config struct
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type I2C_MasterSendBlocking(I2C_ID_Type i2cNo, I2C_Transfer_Cfg *cfg) {
  uint8_t  i;
  uint32_t timeOut = 0;
  uint32_t temp    = 0;
  uint32_t I2Cx    = I2C_BASE;

  /* Check the parameters */
  CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));

  I2C_Disable(i2cNo);
  I2C_Init(i2cNo, I2C_WRITE, cfg);
  I2C_Enable(i2cNo);

  /* Set I2C write data */
  for (i = 0; i < cfg->dataSize; i++) {
    temp += (cfg->data[i] << ((i % 4) * 8));

    if ((i + 1) % 4 == 0) {
      timeOut = I2C_FIFO_STATUS_TIMEOUT;

      while (BL_GET_REG_BITS_VAL(BL_RD_REG(I2Cx, I2C_FIFO_CONFIG_1), I2C_TX_FIFO_CNT) == 0) {
        timeOut--;

        if (timeOut == 0) {
          I2C_Disable(i2cNo);
          return TIMEOUT;
        }
      }

      BL_WR_REG(I2Cx, I2C_FIFO_WDATA, temp);
      temp = 0;
    }
  }

  if ((cfg->dataSize % 4) != 0) {
    timeOut = I2C_FIFO_STATUS_TIMEOUT;

    while (BL_GET_REG_BITS_VAL(BL_RD_REG(I2Cx, I2C_FIFO_CONFIG_1), I2C_TX_FIFO_CNT) == 0) {
      timeOut--;

      if (timeOut == 0) {
        I2C_Disable(i2cNo);
        return TIMEOUT;
      }
    }

    BL_WR_REG(I2Cx, I2C_FIFO_WDATA, temp);
  }

  timeOut = I2C_FIFO_STATUS_TIMEOUT;

  while (I2C_IsBusy(i2cNo) || !I2C_TransferEndStatus(i2cNo)) {
    timeOut--;

    if (timeOut == 0) {
      I2C_Disable(i2cNo);
      return TIMEOUT;
    }
  }

  I2C_Disable(i2cNo);
  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  I2C master read block data
                                                                                *
                                                                                * @param  i2cNo: I2C ID type
                                                                                * @param  cfg: I2C transfer config struct
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type I2C_MasterReceiveBlocking(I2C_ID_Type i2cNo, I2C_Transfer_Cfg *cfg) {
  uint8_t  i       = 0;
  uint32_t timeOut = 0;
  uint32_t temp    = 0;
  uint32_t I2Cx    = I2C_BASE;

  /* Check the parameters */
  CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));

  I2C_Disable(i2cNo);
  I2C_Init(i2cNo, I2C_READ, cfg);
  I2C_Enable(i2cNo);
  timeOut = I2C_FIFO_STATUS_TIMEOUT;
  if (cfg->dataSize == 0 && cfg->subAddrSize == 0) {
    while (BL_RD_REG(I2C_BASE, I2C_BUS_BUSY)) {
      timeOut--;

      if (timeOut == 0) {
        I2C_Disable(i2cNo);
        return TIMEOUT;
      }
    }

    temp = BL_RD_REG(I2C_BASE, I2C_INT_STS); // TODO this sucks as a workaround
    if (BL_IS_REG_BIT_SET(temp, I2C_NAK_INT)) {
      temp = BL_RD_REG(I2C_BASE, I2C_BUS_BUSY);
      I2C_Disable(i2cNo);
      return TIMEOUT;
    }
  }
  /* Read I2C data */
  while (cfg->dataSize - i >= 4) {
    timeOut = I2C_FIFO_STATUS_TIMEOUT;

    while (BL_GET_REG_BITS_VAL(BL_RD_REG(I2Cx, I2C_FIFO_CONFIG_1), I2C_RX_FIFO_CNT) == 0) {
      timeOut--;

      if (timeOut == 0) {
        I2C_Disable(i2cNo);
        return TIMEOUT;
      }
    }

    temp = BL_RD_REG(I2Cx, I2C_FIFO_RDATA);
    PUT_UINT32_LE(temp, cfg->data, i);
    i += 4;
  }

  if (i < cfg->dataSize) {
    timeOut = I2C_FIFO_STATUS_TIMEOUT;

    while (BL_GET_REG_BITS_VAL(BL_RD_REG(I2Cx, I2C_FIFO_CONFIG_1), I2C_RX_FIFO_CNT) == 0) {
      timeOut--;

      if (timeOut == 0) {
        I2C_Disable(i2cNo);
        return TIMEOUT;
      }
    }

    temp = BL_RD_REG(I2Cx, I2C_FIFO_RDATA);

    while (i < cfg->dataSize) {
      cfg->data[i] = (temp & 0xff);
      temp         = (temp >> 8);
      i++;
    }
  }

  timeOut = I2C_FIFO_STATUS_TIMEOUT;

  while (I2C_IsBusy(i2cNo) || !I2C_TransferEndStatus(i2cNo)) {
    timeOut--;

    if (timeOut == 0) {
      I2C_Disable(i2cNo);
      return TIMEOUT;
    }
  }

  I2C_Disable(i2cNo);
  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  Mask/Unmask the I2C interrupt
                                                                                *
                                                                                * @param  i2cNo: I2C ID type
                                                                                * @param  intType: Specifies the interrupt type
                                                                                * @param  intMask: Enable/Disable Specified interrupt type
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void I2C_IntMask(I2C_ID_Type i2cNo, I2C_INT_Type intType, BL_Mask_Type intMask) {
  uint32_t tmpVal;
  uint32_t I2Cx = I2C_BASE;

  /* Check the parameters */
  CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));
  CHECK_PARAM(IS_I2C_INT_TYPE(intType));
  CHECK_PARAM(IS_BL_MASK_TYPE(intMask));

