Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_i2c.c
  tmpVal = BL_RD_REG(I2Cx, I2C_INT_STS);

  switch (intType) {
  case I2C_TRANS_END_INT:
    if (intMask == UNMASK) {
      /* UNMASK(Enable) this interrupt */
      tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_END_EN);
      tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_END_MASK);
    } else {
      /* MASK(Disable) this interrupt */
      tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_END_EN);
      tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_END_MASK);
    }

    break;

  case I2C_TX_FIFO_READY_INT:
    if (intMask == UNMASK) {
      /* UNMASK(Enable) this interrupt */
      tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_TXF_EN);
      tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_TXF_MASK);
    } else {
      /* MASK(Disable) this interrupt */
      tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_TXF_EN);
      tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_TXF_MASK);
    }

    break;

  case I2C_RX_FIFO_READY_INT:
    if (intMask == UNMASK) {
      /* UNMASK(Enable) this interrupt */
      tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_RXF_EN);
      tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_RXF_MASK);
    } else {
      /* MASK(Disable) this interrupt */
      tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_RXF_EN);
      tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_RXF_MASK);
    }

    break;

  case I2C_NACK_RECV_INT:
    if (intMask == UNMASK) {
      /* UNMASK(Enable) this interrupt */
      tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_NAK_EN);
      tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_NAK_MASK);
    } else {
      /* MASK(Disable) this interrupt */
      tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_NAK_EN);
      tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_NAK_MASK);
    }

    break;

  case I2C_ARB_LOST_INT:
    if (intMask == UNMASK) {
      /* UNMASK(Enable) this interrupt */
      tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_ARB_EN);
      tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_ARB_MASK);
    } else {
      /* MASK(Disable) this interrupt */
      tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_ARB_EN);
      tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_ARB_MASK);
    }

    break;

  case I2C_FIFO_ERR_INT:
    if (intMask == UNMASK) {
      /* UNMASK(Enable) this interrupt */
      tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_FER_EN);
      tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_FER_MASK);
    } else {
      /* MASK(Disable) this interrupt */
      tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_FER_EN);
      tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_FER_MASK);
    }

    break;

  case I2C_INT_ALL:
    if (intMask == UNMASK) {
      /* UNMASK(Enable) this interrupt */
      tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_END_EN);
      tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_TXF_EN);
      tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_RXF_EN);
      tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_NAK_EN);
      tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_ARB_EN);
      tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_FER_EN);
      tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_END_MASK);
      tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_TXF_MASK);
      tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_RXF_MASK);
      tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_NAK_MASK);
      tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_ARB_MASK);
      tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_FER_MASK);
    } else {
      /* MASK(Disable) this interrupt */
      tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_END_EN);
      tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_TXF_EN);
      tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_RXF_EN);
      tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_NAK_EN);
      tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_ARB_EN);
      tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_FER_EN);
      tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_END_MASK);
      tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_TXF_MASK);
      tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_RXF_MASK);
      tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_NAK_MASK);
      tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_ARB_MASK);
      tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_FER_MASK);
    }

    break;

  default:
    break;
  }

  BL_WR_REG(I2Cx, I2C_INT_STS, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  Install I2C interrupt callback function
                                                                                *
                                                                                * @param  i2cNo: I2C ID type
                                                                                * @param  intType: Specifies the interrupt type
                                                                                * @param  cbFun: Pointer to interrupt callback function. The type should be void (*fn)(void)
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void I2C_Int_Callback_Install(I2C_ID_Type i2cNo, I2C_INT_Type intType, intCallback_Type *cbFun) {
  /* Check the parameters */
  CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));
  CHECK_PARAM(IS_I2C_INT_TYPE(intType));

  i2cIntCbfArra[i2cNo][intType] = cbFun;
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  I2C IRQ handler
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void I2C_IRQHandler(void) { I2C_IntHandler(I2C0_ID); }
#endif

/*@} end of group I2C_Public_Functions */

/*@} end of group I2C */

/*@} end of group BL702_Peripheral_Driver */
